app/controllers/pages_controller.rb

SELECT "pages".* FROM "pages" WHERE "pages"."id" IS NULL LIMIT 1
---
  def find_page
    return redirect_to :action => :index unless params.has_key? :id
    @page = Page.find_by_id params[:id]

SELECT "pages".* FROM "pages" ORDER BY stripped_url
---
  def index
    @pages = Page.all(:order => :stripped_url)

INSERT INTO "pages" ("created_at", "updated_at", "url") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 05 Jun 2013 09:25:50 UTC +00:00], ["updated_at", Wed, 05 Jun 2013 09:25:50 UTC +00:00], ["url", nil]]
---
  def create
    @page = Page.strip_url_and_find params[:page][:url]
    return redirect_to @page unless @page.nil?
    @page = Page.new(params[:page])
    @page.save

UPDATE "pages" SET "stripped_url" = 'faitherina.com', "updated_at" = '2013-06-05 10:30:25.930436' WHERE "pages"."id" = 8
---
  def update
    if @page.update_attributes(params[:page])

DELETE FROM "pages" WHERE "pages"."id" = 4
---
  def destroy
    @page.delete