app/controllers/updates_controller.rb

  def find_update
    return redirect_to :action => :index unless params.has_key? :id
    @update = Update.find_by_id params[:id]
---
SELECT "updates".* FROM "updates" WHERE "updates"."id" = $1 LIMIT 1  [["id", "2"]]